brew "awscli"
brew "bat"
brew "ffmpeg"
brew "ImageMagick"
brew "kubectx"
brew "kubernetes-cli"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "ngrok"

cask "alacritty"
cask "brave-browser"
cask "cron"
cask "docker"
cask "karabiner-elements"
cask "mongodb-compass"
cask "pgadmin4"
cask "raycast"
cask "slack"
cask "spotify"
cask "trailer"
cask "whatsapp"
cask "fig"

# Tilt
# Enable Kubernetes in Docker preferences beforehand

# kubectl config use-context docker-desktop
# tap "vmware-tanzu/buildkit-cli-for-kubectl https://github.com/vmware-tanzu/buildkit-cli-for-kubectl"

brew "coreutils"
brew "entr"
brew "helm"
brew "jq"
brew "kubectl-buildkit"
brew "tilt-dev/tap/tilt"
brew "txn2/tap/kubefwd"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
